<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Book Reader</title><meta name="generator" content="DocBook XSL Stylesheets V1.68.1"><meta name="description" content=" &#1055;&#1088;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1090;&#1072;&#1082;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;: JavaScript, CSS, JQuery."><link rel="start" href="DocBlock.html" title="Book Reader"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Book Reader</th></tr></table><hr></div><div class="article" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="id572747"></a>Book Reader</h2></div><div><div class="abstract"><p class="title"><b></b></p><p>&#1055;&#1088;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1090;&#1072;&#1082;&#1080;&#1077; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;: JavaScript, CSS, JQuery.</p></div></div></div><hr></div><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1082;&#1085;&#1080;&#1075;&#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; : ePub, fb2, txt. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1082;&#1072;&#1082; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103;  &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072; GoogleChrome.</p><p>&#1055;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1090; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1058;&#1047;, &#1086;&#1073;&#1091;&#1089;&#1083;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1081;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1088;&#1077;&#1076;&#1082;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;&#1093; &#1082;&#1072;&#1082; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1083;&#1080;&#1073;&#1086; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;  &#1085;&#1077;&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1084;.</p><div class="abstract"><p class="title"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1: &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1082;&#1085;&#1080;&#1075;&#1080;</b></p><p>&#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102; &#1082;&#1085;&#1080;&#1075;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1086;&#1101;&#1082;&#1090;&#1072; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1077;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072;.</p><p>function preview()
{
  </p><p>document.getElementById('menu').style.display = 'none';
  </p><p>var reader = new FileReader();
  
  </p><p>var xhr = new XMLHttpRequest();</p><p>xhr.open('GET', 'books/Preview.txt', true)
  xhr.send(null);

  </p><p>xhr.onreadystatechange = function(){
    </p><p>if(xhr.readyState === 4)
    </p><p>{
      </p><p>bookFromText(xhr.responseText);
    </p><p>}
  </p><p>}

</p><p>document.addEventListener('mousedown', function(evt) {mover = new moving(evt);}, false);
  </p><p>document.addEventListener('mousemove', function(evt) {mover.mouseMove(evt);}, false);</p><p>
  document.addEventListener('mouseup', function(evt) {mover.mouseEnd(evt);}, false);
  </p><p>document.addEventListener('touchstart', function(evt) {mover = new moving(evt);}, false);
  </p><p>document.addEventListener('touchmove', function(evt) {mover.mouseMove(evt);}, false);</p><p>
  document.addEventListener('touchend', function(evt) {mover.mouseEnd(evt);}, false);

</p><p>var back = document.getElementById('back');

</p><p>back.addEventListener('click', function() {resetBook();}, false);
}</p></div><div class="abstract"><p class="title"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2: &#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;</b></p><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1089;&#1093;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1082;&#1085;&#1080;&#1075;&#1080; &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;.</p><p>function resetBook() {
    </p><p>book = null;
    document.getElementsByTagName('input')[0].value = '';
    </p><p>document.getElementById('fileHolder').style.display = 'block';
    </p><p>document.getElementById('pages').innerHTML = '';
    </p><p>chapter = 0;
    </p><p>page = 0;
    </p><p>document.getElementById('menu').style.display = 'none';
</p><p>}</p></div><div class="abstract"><p class="title"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3: &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1082;&#1085;&#1080;&#1075;&#1080;</b></p><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; HTML.</p><p>function showChapter(dir) {
  </p><p>if(book &amp;&amp; book.opf.spine[chapter])
  {
    </p><p>var spine = book.opf.spine[chapter];
    </p><p>var href = book.opf.manifest[spine]['href'];
    </p><p>var doc = book.files[href];
    </p><p>var html = new XMLSerializer().serializeToString(doc);
    </p><p>var bookBox = document.getElementById('pages');
    </p><p>bookBox.innerHTML = html;
    </p><p>buildPages();
    chapter += 1;
  </p><p>} else {
    </p><p>resetBook();
  </p><p>}
</p><p>}</p></div></div><div class="navfooter"><hr></div></body></html>
